# IsFamilyDocument Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsFamilyDocument Property
Document Class See Also
---
Identifies if the current document is a family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFamilyDocument { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFamilyDocument As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFamilyDocument {
	bool get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace